Revit 2027 API
Form.DeleteSubElement Method
Delete a face/edge/curve/vertex of the form, specified by a reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteSubElement(
	Reference subElementReference
)
Public Sub DeleteSubElement (
	subElementReference As Reference
)
public:
void DeleteSubElement(
	Reference^ subElementReference
)
member DeleteSubElement :
        subElementReference : Reference -> unit
Parameters
subElementReference Reference
The geometry reference of face/edge/curve/vertex
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace